princeton/ipvs/results/timeseries/time-scales/1_X_max/single-backend/500ms-fluctuation/3mins-run/20ms-feedback/wlc/1111-seed/run/httperf_client_123.log
httperf --verbose --hog --timeout=50 --client=0/1 --server=172.16.116.116 --port=8080 --uri=/ --rate=8 --send-buffer=4096 --recv-buffer=16384 --num-conns=1440 --num-calls=1
httperf: maximum number of open descriptors = 65535
Maximum connect burst length: 1

Connection lifetime histogram (time in ms):
             :
            10.5 60
            11.5 352
            12.5 183
            13.5 170
            14.5 97
            15.5 86
            16.5 123
            17.5 109
            18.5 58
            19.5 47
            20.5 23
            21.5 9
            22.5 4
            23.5 4
            24.5 4
            25.5 3
            26.5 2
            27.5 2
             :
            29.5 2
             :
            34.5 1
             :
            40.5 1
             :
            69.5 2
            70.5 1
             :
            80.5 2
             :
            90.5 1
            91.5 1
            92.5 1
             :
            94.5 1
             :
            96.5 1
             :
           101.5 1
             :
           108.5 1
             :
           116.5 2
             :
           118.5 1
             :
           121.5 1
             :
           129.5 1
             :
           132.5 1
           133.5 1
             :
           140.5 1
           141.5 1
             :
           143.5 1
             :
           149.5 1
             :
           156.5 1
             :
           161.5 1
             :
           163.5 2
             :
           165.5 1
           166.5 1
             :
           168.5 1
           169.5 1
             :
           172.5 1
             :
           175.5 1
           176.5 2
             :
           179.5 1
             :
           183.5 3
           184.5 2
             :
           186.5 2
           187.5 1
             :
           189.5 1
             :
           191.5 2
             :
           193.5 1
           194.5 1
             :
           196.5 2
             :
           203.5 2
             :
           205.5 1
             :
           207.5 1
             :
           210.5 1
             :
           213.5 1
           214.5 1
             :
           216.5 1
           217.5 2
             :
           219.5 2
           220.5 1
             :
           222.5 1
             :
           226.5 3
           227.5 1
           228.5 1
             :
           235.5 1
             :
           237.5 1
             :
           241.5 2
             :
           246.5 1
             :
           252.5 1
             :
           256.5 1
             :
           258.5 2
             :
           264.5 1
           265.5 1
             :
           267.5 1
             :
           272.5 1
             :
           277.5 3
             :
           282.5 1
           283.5 1
             :
           285.5 1
             :
           287.5 1
           288.5 1
             :
           290.5 1
           291.5 1
             :
           293.5 1
             :
           307.5 1
             :
           316.5 1
           317.5 1
           318.5 1
             :
           323.5 1
             :
           325.5 1

Total: connections 1440 requests 1440 replies 1440 test-duration 179.893 s

Connection rate: 8.0 conn/s (124.9 ms/conn, <=2 concurrent connections)
Connection time [ms]: min 10.5 avg 27.2 max 325.5 median 13.5 stddev 50.4
Connection time [ms]: connect 0.9
Connection length [replies/conn]: 1.000

Request rate: 8.0 req/s (124.9 ms/req)
Request size [B]: 67.0

Reply rate [replies/s]: min 7.0 avg 8.0 max 9.0 stddev 0.3 (179 samples)
Percentages of the replies served at a given rate:
   50%: 7
   66%: 7
   75%: 7
   80%: 7
   90%: 7
   95%: 7
   98%: 8
   99%: 8
  100%: 9

Reply time [ms]: response 25.0 transfer 1.2
Percentages of the requests served within a certain time (ms) :
   50%: 12
   66%: 14
   75%: 15
   80%: 16
   90%: 18
   95%: 156
   98%: 219
   99%: 254
  100%: 323

Reply size [B]: header 163.0 content 72.0 footer 2.0 (total 237.0)
Reply status: 1xx=0 2xx=1440 3xx=0 4xx=0 5xx=0

CPU time [s]: user 150.90 system 28.70 (user 83.9% system 16.0% total 99.8%)
Net I/O: 2.4 KB/s (0.0*10^6 bps)

Errors: total 0 client-timo 0 socket-timo 0 connrefused 0 connreset 0
Errors: fd-unavail 0 addrunavail 0 ftab-full 0 other 0